bluekitchen/btstack/port/max32630-fthr/maxim/Firmware/MAX3263X/Libraries/CMSIS/Device/Maxim/MAX3263X/Include/max3263x.svd
        <!-- CLK_GATE_CTRL0: Dynamic Clock Gating Control Register 0 -->
        <register>
          <name>CLK_GATE_CTRL0</name>
          <description>Dynamic Clock Gating Control Register 0</description>
          <addressOffset>0x0140</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>cm4_clk_gater</name>
              <description>Clock Gating Control for CM4 CPU</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ahb32_clk_gater</name>
              <description>Clock Gating Control for AHB32</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[3:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>icache_clk_gater</name>
              <description>Clock Gating Control for Instruction Cache</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>flash_clk_gater</name>
              <description>Clock Gating Control for Flash Memory</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[7:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>sram_clk_gater</name>
              <description>Clock Gating Control for SRAM</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[9:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>apb_bridge_clk_gater</name>
              <description>Clock Gating Control for AHB-to-APB Bridge</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[11:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>sysman_clk_gater</name>
              <description>Clock Gating Control for CLKMAN, PWRMAN, and IOMAN</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[13:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ptp_clk_gater</name>
              <description>Clock Gating Control for PTP Logic</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[15:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ssb_mux_clk_gater</name>
              <description>Clock Gating Control for SSB Mux</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[17:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pad_clk_gater</name>
              <description>Clock Gating Control for Pad Mode Filter</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[19:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>spix_clk_gater</name>
              <description>Clock Gating Control for SPI XIP</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[21:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pmu_clk_gater</name>
              <description>Clock Gating Control for PMU</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[23:22]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>usb_clk_gater</name>
              <description>Clock Gating Control for USB</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[25:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>crc_clk_gater</name>
              <description>Clock Gating Control for CRC</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[27:26]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>tpu_clk_gater</name>
              <description>Clock Gating Control for TPU</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[29:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>watchdog0_clk_gater</name>
              <description>Clock Gating Control for Watchdog Timer 0</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[31:30]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <!-- CLK_GATE_CTRL1: Dynamic Clock Gating Control Register 1 -->
        <register>
          <name>CLK_GATE_CTRL1</name>
          <description>Dynamic Clock Gating Control Register 1</description>
          <addressOffset>0x0144</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>watchdog1_clk_gater</name>
              <description>Clock Gating Control for Watchdog Timer 1</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>gpio_clk_gater</name>
              <description>Clock Gating Control for GPIO Ports</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[3:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>timer0_clk_gater</name>
              <description>Clock Gating Control for Timer/Counter Module 0</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>timer1_clk_gater</name>
              <description>Clock Gating Control for Timer/Counter Module 1</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[7:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>timer2_clk_gater</name>
              <description>Clock Gating Control for Timer/Counter Module 2</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[9:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>timer3_clk_gater</name>
              <description>Clock Gating Control for Timer/Counter Module 3</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[11:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>timer4_clk_gater</name>
              <description>Clock Gating Control for Timer/Counter Module 4</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[13:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>timer5_clk_gater</name>
              <description>Clock Gating Control for Timer/Counter Module 5</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[15:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pulsetrain_clk_gater</name>
              <description>Clock Gating Control for Pulse Train Generators</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[17:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>uart0_clk_gater</name>
              <description>Clock Gating Control for UART 0</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[19:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>uart1_clk_gater</name>
              <description>Clock Gating Control for UART 1</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[21:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>uart2_clk_gater</name>
              <description>Clock Gating Control for UART 2</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[23:22]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>uart3_clk_gater</name>
              <description>Clock Gating Control for UART 3</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[25:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>i2cm0_clk_gater</name>
              <description>Clock Gating Control for I2C Master 0</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[27:26]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>i2cm1_clk_gater</name>
              <description>Clock Gating Control for I2C Master 1</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[29:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>i2cm2_clk_gater</name>
              <description>Clock Gating Control for I2C Master 2</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[31:30]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <!-- CLK_GATE_CTRL2: Dynamic Clock Gating Control Register 2 -->
        <register>
          <name>CLK_GATE_CTRL2</name>
          <description>Dynamic Clock Gating Control Register 2</description>
          <addressOffset>0x0148</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>i2cs_clk_gater</name>
              <description>Clock Gating Control for I2C Slave</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>spi0_clk_gater</name>
              <description>Clock Gating Control for SPI Master 0</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[3:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>spi1_clk_gater</name>
              <description>Clock Gating Control for SPI Master 1</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>spi2_clk_gater</name>
              <description>Clock Gating Control for SPI Master 2</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[7:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>spi_bridge_clk_gater</name>
              <description>Clock Gating Control for SPI Bridge</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[9:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>owm_clk_gater</name>
              <description>Clock Gating Control for 1-Wire Master (OWM)</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[11:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>adc_clk_gater</name>
              <description>Clock Gating Control for ADC</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[13:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>spis_clk_gater</name>
              <description>Clock Gating Control for SPI Slave</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[15:14]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

