bluekitchen/btstack/port/max32630-fthr/maxim/Firmware/MAX3263X/Libraries/CMSIS/Device/Maxim/MAX3263X/Include/max3263x.svd
        <!-- BASE_PART_NUM: Base Part Number -->
        <register>
          <name>BASE_PART_NUM</name>
          <description>Base Part Number</description>
          <addressOffset>0x003C</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>base_part_number</name>
              <description>Base Part Number</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>

        <!-- MASK_ID0: Mask ID Register 0 -->
        <register>
          <name>MASK_ID0</name>
          <description>Mask ID Register 0</description>
          <addressOffset>0x0040</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>revision_id</name>
              <description>Revision ID</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[3:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>mask_id</name>
              <description>Mask ID[27:0]</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[31:4]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>

        <!-- MASK_ID1: Mask ID Register 1 -->
        <register>
          <name>MASK_ID1</name>
          <description>Mask ID Register 1</description>
          <addressOffset>0x0044</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>mask_id</name>
              <description>Mask ID[58:28]</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[30:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>mask_id_enable</name>
              <description>Enable Mask ID</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <!-- PERIPHERAL_RESET: Peripheral Reset Control Register -->
        <register>
          <name>PERIPHERAL_RESET</name>
          <description>Peripheral Reset Control Register</description>
          <addressOffset>0x0048</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>ssb</name>
              <description>Reset SSB</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>spix</name>
              <description>Reset SPI XIP</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pmu</name>
              <description>Reset PMU</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>usb</name>
              <description>Reset USB</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>crc</name>
              <description>Reset CRC</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>tpu</name>
              <description>Reset TPU</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>watchdog0</name>
              <description>Reset Watchdog Timer 0</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>gpio</name>
              <description>Reset GPIO</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>timer0</name>
              <description>Reset Timer/Counter Module 0</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>timer1</name>
              <description>Reset Timer/Counter Module 1</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>timer2</name>
              <description>Reset Timer/Counter Module 2</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>timer3</name>
              <description>Reset Timer/Counter Module 3</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>timer4</name>
              <description>Reset Timer/Counter Module 4</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>timer5</name>
              <description>Reset Timer/Counter Module 5</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pulse_train</name>
              <description>Reset All Pulse Trains</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>uart0</name>
              <description>Reset UART 0</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>uart1</name>
              <description>Reset UART 1</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>uart2</name>
              <description>Reset UART 2</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>uart3</name>
              <description>Reset UART 3</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>i2cm0</name>
              <description>Reset I2C Master 0</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>i2cm1</name>
              <description>Reset I2C Master 1</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>i2cm2</name>
              <description>Reset I2C Master 2</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>i2cs</name>
              <description>Reset I2C Slave</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>spim0</name>
              <description>Reset SPI Master 0</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>spim1</name>
              <description>Reset SPI Master 1</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>spim2</name>
              <description>Reset SPI Master 2</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>spib</name>
              <description>Reset SPI Bridge</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>owm</name>
              <description>Reset 1-Wire Master</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[27:27]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>adc</name>
              <description>Reset ADC</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

