bluekitchen/btstack/port/max32630-fthr/maxim/Firmware/MAX3263X/Libraries/CMSIS/Device/Maxim/MAX3263X/Include/max3263x.svd
      </registers>
    </peripheral>


    <!-- RTC:RTCTMR -->

    <peripheral>
      <name>RTCTMR</name>
      <description>Real Time Clock</description>
      <groupName>Real-Time Clock</groupName>
      <baseAddress>0x40000A00</baseAddress>
      <size>32</size>
      <access>read-write</access>

      <addressBlock>
        <offset>0</offset>
        <size>0x0030</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>RTC_COMP0</name>
        <value>3</value>
        <description>RTC Compare 0 IRQ</description>
      </interrupt>
      <interrupt>
        <name>RTC_COMP1</name>
        <value>4</value>
        <description>RTC Compare 1 IRQ</description>
      </interrupt>
      <interrupt>
        <name>RTC_PRESCALE_COMP</name>
        <value>5</value>
        <description>RTC Prescale Compare IRQ</description>
      </interrupt>
      <interrupt>
        <name>RTC_OVERFLOW</name>
        <value>6</value>
        <description>RTC Overflow IRQ</description>
      </interrupt>

      <registers>

        <!-- CTRL: RTC Timer Control -->
        <register>
          <name>CTRL</name>
          <description>RTC Timer Control</description>
          <addressOffset>0x0000</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>enable</name>
              <description>RTC Timer Enable</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>clear</name>
              <description>RTC Timer Clear Bit</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[1:1]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>pending</name>
              <description>RTC Transaction Pending</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>use_async_flags</name>
              <description>Use Async RTC Flags</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>aggressive_rst</name>
              <description>Use Aggressive Reset Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>en_active</name>
              <description>Enable RTC in Active Modes</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[16:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>osc_goto_low_active</name>
              <description>osc_goto_low_r transaction is pending</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[17:17]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>osc_frce_sm_en_active</name>
              <description>osc_force_mode transaction is pending</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[18:18]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>osc_frce_st_active</name>
              <description>osc_force_state transaction is pending</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[19:19]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>set_active</name>
              <description>timer_set_active</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[20:20]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>clr_active</name>
              <description>RTC clear is pending</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[21:21]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>rollover_clr_active</name>
              <description>rollover clr is pending</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[22:22]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>prescale_cmpr0_active</name>
              <description>prescale cmpr0 is pending</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[23:23]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>prescale_update_active</name>
              <description>prescale update transaction is pending</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[24:24]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>cmpr1_clr_active</name>
              <description>cmpr1 clear transaction is pending</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[25:25]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>cmpr0_clr_active</name>
              <description>cmpr0 clear transaction is pending</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[26:26]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>

        <!-- TIMER: RTC Timer Count Value -->
        <register>
          <name>TIMER</name>
          <description>RTC Timer Count Value</description>
          <addressOffset>0x0004</addressOffset>
          <access>read-write</access>
        </register>

        <!-- COMP0: RTC Time of Day Alarm 0 Compare Register -->
        <register>
          <name>COMP0</name>
          <description>RTC Time of Day Alarm 0 Compare Register</description>
          <addressOffset>0x0008</addressOffset>
          <access>read-write</access>
        </register>

        <!-- COMP1: RTC Time of Day Alarm 1 Compare Register -->
        <register>
          <name>COMP1</name>
          <description>RTC Time of Day Alarm 1 Compare Register</description>
          <addressOffset>0x000C</addressOffset>
          <access>read-write</access>
        </register>

