bluekitchen/btstack/port/max32630-fthr/maxim/Firmware/MAX3263X/Libraries/CMSIS/Device/Maxim/MAX3263X/Include/max3263x.svd
        <!-- FLAGS: CPU Interrupt and RTC Domain Flags -->
        <register>
          <name>FLAGS</name>
          <description>CPU Interrupt and RTC Domain Flags</description>
          <addressOffset>0x0010</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>comp0</name>
              <description>RTC Compare 0 Interrupt Status</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>comp1</name>
              <description>RTC Compare 1 Interrupt Status</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>prescale_comp</name>
              <description>RTC Prescale Compare Int Status</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>overflow</name>
              <description>RTC Overflow Interrupt Status</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>trim</name>
              <description>RTC Trim Interrupt Status</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>comp0_flag_a</name>
              <description>RTC Compare 0 4kHz Flag</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[8:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>comp1_flag_a</name>
              <description>RTC Compare 1 4kHz Flag</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[9:9]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>prescl_flag_a</name>
              <description>RTC Prescale Compare 4kHz Flag</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[10:10]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>overflow_flag_a</name>
              <description>RTC Overflow 4kHz Flag</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[11:11]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>trim_flag_a</name>
              <description>RTC Trim Event 4kHz Flag</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[12:12]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>async_clr_flags</name>
              <description>Asynchronous RTC Flag Clear</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[31:31]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>

        <!-- SNZ_VALUE: RTC Timer Alarm Snooze Value -->
        <register>
          <name>SNZ_VALUE</name>
          <description>RTC Timer Alarm Snooze Value</description>
          <addressOffset>0x0014</addressOffset>
          <access>read-write</access>
        </register>

        <!-- INTEN: Interrupt Enable Controls -->
        <register>
          <name>INTEN</name>
          <description>Interrupt Enable Controls</description>
          <addressOffset>0x0018</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>comp0</name>
              <description>RTC Time of Day Alarm (Compare 0) Interrupt Enable</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>comp1</name>
              <description>RTC Time of Day Alarm (Compare 1) Interrupt Enable</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>prescale_comp</name>
              <description>RTC Prescale Compare Int Enable</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>overflow</name>
              <description>RTC Overflow Interrupt Enable</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>trim</name>
              <description>RTC Trim Adjust Event Interrupt Enable</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <!-- PRESCALE: RTC Timer Prescale Setting -->
        <register>
          <name>PRESCALE</name>
          <description>RTC Timer Prescale Setting</description>
          <addressOffset>0x001C</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>width_selection</name>
              <description>RTC Timer Prescale Setting</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <!-- PRESCALE_MASK: RTC Timer Prescale Compare Mask -->
        <register>
          <name>PRESCALE_MASK</name>
          <description>RTC Timer Prescale Compare Mask</description>
          <addressOffset>0x0024</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>comp_mask</name>
              <description>RTC Timer Prescale Compare Mask</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

