bluekitchen/btstack/port/max32630-fthr/maxim/Firmware/MAX3263X/Libraries/CMSIS/Device/Maxim/MAX3263X/Include/max3263x.svd
        <!-- TRIM_CTRL: RTC Timer Trim Controls -->
        <register>
          <name>TRIM_CTRL</name>
          <description>RTC Timer Trim Controls</description>
          <addressOffset>0x0028</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>trim_enable_r</name>
              <description>Enable RTL Trim of RTC Timer</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>trim_faster_ovr_r</name>
              <description>Force RTC Trim to Faster</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>trim_slower_r</name>
              <description>RTC Trim Direction Status</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>

        <!-- TRIM_VALUE: RTC Timer Trim Adjustment Interval -->
        <register>
          <name>TRIM_VALUE</name>
          <description>RTC Timer Trim Adjustment Interval</description>
          <addressOffset>0x002C</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>trim_value</name>
              <description>Trim PPM Value</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[17:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>trim_control</name>
              <description>Trim Direction</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

      </registers>
    </peripheral>


    <!-- RTC:RTCCFG -->

    <peripheral>
      <name>RTCCFG</name>
      <description>RTC Configuration Register</description>
      <groupName>Real-Time Clock</groupName>
      <baseAddress>0x40000A70</baseAddress>
      <size>32</size>
      <access>read-write</access>

      <addressBlock>
        <offset>0</offset>
        <size>0x0090</size>
        <usage>registers</usage>
      </addressBlock>

      <registers>

        <!-- NANO_CNTR: Nano Oscillator Counter Read Register -->
        <register>
          <name>NANO_CNTR</name>
          <description>Nano Oscillator Counter Read Register</description>
          <addressOffset>0x0000</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>nanoring_counter</name>
              <description>Nano Oscillator Counter</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>

        <!-- CLK_CTRL: RTC Clock Control Settings -->
        <register>
          <name>CLK_CTRL</name>
          <description>RTC Clock Control Settings</description>
          <addressOffset>0x0004</addressOffset>
          <fields>
            <field>
              <name>nano_en</name>
              <description>Enable nanoring oscillator output</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <!-- OSC_CTRL: RTC Oscillator Control -->
        <register>
          <name>OSC_CTRL</name>
          <description>RTC Oscillator Control</description>
          <addressOffset>0x000C</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>osc_bypass</name>
              <description>Bypass RTC oscillator</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>osc_disable_r</name>
              <description>if osc_disable_sel = 1, this will hold the RTC in reset.</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>osc_disable_sel</name>
              <description>Select RTC Oscillator Disable Control Source</description>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PwrSeq_Control</name>
                  <description>PowerSequencer controls the reset state of the RTC</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTC_Domain_Control</name>
                  <description>RTC reset controlled by osc_disable_r bit</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>osc_disable_o</name>
              <description>Reset RTC Oscillator</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>

      </registers>
    </peripheral>


    <!-- PWRSEQ:PWRSEQ -->

    <peripheral>
      <name>PWRSEQ</name>
      <description>Power Sequencer</description>
      <groupName>Power Manager</groupName>
      <baseAddress>0x40000A30</baseAddress>
      <size>32</size>
      <access>read-write</access>

      <addressBlock>
        <offset>0</offset>
        <size>0x0040</size>
        <usage>registers</usage>
      </addressBlock>

