bluekitchen/btstack/port/max32630-fthr/maxim/Firmware/MAX3263X/Libraries/CMSIS/Device/Maxim/MAX3263X/Include/max3263x.svd
      </registers>
    </peripheral>


    <!-- SYSMAN:IOMAN -->

    <peripheral>
      <name>IOMAN</name>
      <description>System I/O Manager</description>
      <groupName>IO</groupName>
      <baseAddress>0x40000C00</baseAddress>
      <size>32</size>
      <access>read-write</access>

      <addressBlock>
        <offset>0</offset>
        <size>0x0400</size>
        <usage>registers</usage>
      </addressBlock>

      <registers>

        <!-- WUD_REQ0: Wakeup Detect Mode Request Register 0 (P0/P1/P2/P3) -->
        <register>
          <name>WUD_REQ0</name>
          <description>Wakeup Detect Mode Request Register 0 (P0/P1/P2/P3)</description>
          <addressOffset>0x0000</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>wud_req_p0</name>
              <description>Wakeup Detect Request Mode: P0[7:0]</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>wud_req_p1</name>
              <description>Wakeup Detect Request Mode: P1[7:0]</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>wud_req_p2</name>
              <description>Wakeup Detect Request Mode: P2[7:0]</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>wud_req_p3</name>
              <description>Wakeup Detect Request Mode: P3[7:0]</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[31:24]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <!-- WUD_REQ1: Wakeup Detect Mode Request Register 1 (P4/P5/P6) -->
        <register>
          <name>WUD_REQ1</name>
          <description>Wakeup Detect Mode Request Register 1 (P4/P5/P6)</description>
          <addressOffset>0x0004</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>wud_req_p4</name>
              <description>Wakeup Detect Request Mode: P4[7:0]</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>wud_req_p5</name>
              <description>Wakeup Detect Request Mode: P5[7:0]</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>wud_req_p6</name>
              <description>Wakeup Detect Request Mode: P6[0]</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <!-- WUD_ACK0: Wakeup Detect Mode Acknowledge Register 0 (P0/P1/P2/P3) -->
        <register>
          <name>WUD_ACK0</name>
          <description>Wakeup Detect Mode Acknowledge Register 0 (P0/P1/P2/P3)</description>
          <addressOffset>0x0008</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>wud_ack_p0</name>
              <description>WUD Mode Acknowledge: P0[7:0]</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[7:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>wud_ack_p1</name>
              <description>WUD Mode Acknowledge: P1[7:0]</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[15:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>wud_ack_p2</name>
              <description>WUD Mode Acknowledge: P2[7:0]</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[23:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>wud_ack_p3</name>
              <description>WUD Mode Acknowledge: P3[7:0]</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[31:24]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>

        <!-- WUD_ACK1: Wakeup Detect Mode Acknowledge Register 1 (P4/P5/P6) -->
        <register>
          <name>WUD_ACK1</name>
          <description>Wakeup Detect Mode Acknowledge Register 1 (P4/P5/P6)</description>
          <addressOffset>0x000C</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>wud_ack_p4</name>
              <description>WUD Mode Acknowledge: P4[7:0]</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[7:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>wud_ack_p5</name>
              <description>WUD Mode Acknowledge: P5[7:0]</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[15:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>wud_ack_p6</name>
              <description>WUD Mode Acknowledge: P6[7:0]</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[16:16]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>

        <!-- ALI_REQ0: Analog Input Request Register 0 (P0/P1/P2/P3) -->
        <register>
          <name>ALI_REQ0</name>
          <description>Analog Input Request Register 0 (P0/P1/P2/P3)</description>
          <addressOffset>0x0010</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>ali_req_p0</name>
              <description>Analog Input Mode Request: P0[7:0]</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ali_req_p1</name>
              <description>Analog Input Mode Request: P1[7:0]</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ali_req_p2</name>
              <description>Analog Input Mode Request: P2[7:0]</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ali_req_p3</name>
              <description>Analog Input Mode Request: P3[7:0]</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[31:24]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <!-- ALI_REQ1: Analog Input Request Register 1 (P4/P5/P6) -->
        <register>
          <name>ALI_REQ1</name>
          <description>Analog Input Request Register 1 (P4/P5/P6)</description>
          <addressOffset>0x0014</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>ali_req_p4</name>
              <description>Analog Input Mode Request: P4[7:0]</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ali_req_p5</name>
              <description>Analog Input Mode Request: P5[7:0]</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ali_req_p6</name>
              <description>Analog Input Mode Request: P6[0]</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <!-- ALI_ACK0: Analog Input Acknowledge Register 0 (P0/P1/P2/P3) -->
        <register>
          <name>ALI_ACK0</name>
          <description>Analog Input Acknowledge Register 0 (P0/P1/P2/P3)</description>
          <addressOffset>0x0018</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>ali_ack_p0</name>
              <description>Analog In Mode Acknowledge: P0[7:0]</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[7:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ali_ack_p1</name>
              <description>Analog In Mode Acknowledge: P1[7:0]</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[15:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ali_ack_p2</name>
              <description>Analog In Mode Acknowledge: P2[7:0]</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[23:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ali_ack_p3</name>
              <description>Analog In Mode Acknowledge: P3[7:0]</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[31:24]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>

        <!-- ALI_ACK1: Analog Input Acknowledge Register 1 (P4/P5/P6) -->
        <register>
          <name>ALI_ACK1</name>
          <description>Analog Input Acknowledge Register 1 (P4/P5/P6)</description>
          <addressOffset>0x001C</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>ali_ack_p4</name>
              <description>Analog In Mode Acknowledge: P4[7:0]</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[7:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ali_ack_p5</name>
              <description>Analog In Mode Acknowledge: P5[7:0]</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[15:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ali_ack_p6</name>
              <description>Analog In Mode Acknowledge: P6[0]</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[16:16]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>

