bluekitchen/btstack/port/max32630-fthr/maxim/Firmware/MAX3263X/Libraries/CMSIS/Device/Maxim/MAX3263X/Include/max3263x.svd
        <!-- UART2_REQ: UART2 I/O Mode Request -->
        <register>
          <name>UART2_REQ</name>
          <description>UART2 I/O Mode Request</description>
          <addressOffset>0x0040</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>io_map</name>
              <description>UART2 TX/RX I/O Mapping Select</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>cts_map</name>
              <description>UART2 CTS I/O Mapping Select</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>rts_map</name>
              <description>UART2 RTS I/O Mapping Select</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>io_req</name>
              <description>UART2 TX/RX I/O Request</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>cts_io_req</name>
              <description>UART2 CTS I/O Request</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>rts_io_req</name>
              <description>UART2 RTS I/O Request</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <!-- UART2_ACK: UART2 I/O Mode Acknowledge -->
        <register>
          <name>UART2_ACK</name>
          <description>UART2 I/O Mode Acknowledge</description>
          <addressOffset>0x0044</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>io_map</name>
              <description>UART2 TX/RX I/O Mapping Acknowledge</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>cts_map</name>
              <description>UART2 CTS I/O Mapping Acknowledge</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>rts_map</name>
              <description>UART2 RTS I/O Mapping Acknowledge</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>io_req</name>
              <description>UART2 TX/RX I/O Acknowledge</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>cts_io_req</name>
              <description>UART2 CTS I/O Acknowledge</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[5:5]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>rts_io_req</name>
              <description>UART2 RTS I/O Acknowledge</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[6:6]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>

        <!-- UART3_REQ: UART3 I/O Mode Request -->
        <register>
          <name>UART3_REQ</name>
          <description>UART3 I/O Mode Request</description>
          <addressOffset>0x0048</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>io_map</name>
              <description>UART3 TX/RX I/O Mapping Select</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>cts_map</name>
              <description>UART3 CTS I/O Mapping Select</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>rts_map</name>
              <description>UART3 RTS I/O Mapping Select</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>io_req</name>
              <description>UART3 TX/RX I/O Request</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>cts_io_req</name>
              <description>UART3 CTS I/O Request</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>rts_io_req</name>
              <description>UART3 RTS I/O Request</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <!-- UART3_ACK: UART3 I/O Mode Acknowledge -->
        <register>
          <name>UART3_ACK</name>
          <description>UART3 I/O Mode Acknowledge</description>
          <addressOffset>0x004C</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>io_map</name>
              <description>UART3 TX/RX I/O Mapping Acknowledge</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>cts_map</name>
              <description>UART3 CTS I/O Mapping Acknowledge</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>rts_map</name>
              <description>UART3 RTS I/O Mapping Acknowledge</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>io_req</name>
              <description>UART3 TX/RX I/O Acknowledge</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>cts_io_req</name>
              <description>UART3 CTS I/O Acknowledge</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[5:5]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>rts_io_req</name>
              <description>UART3 RTS I/O Acknowledge</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[6:6]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>

        <!-- I2CM0_REQ: I2C Master 0 I/O Request -->
        <register>
          <name>I2CM0_REQ</name>
          <description>I2C Master 0 I/O Request</description>
          <addressOffset>0x0050</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>mapping_req</name>
              <description>I2C Master 0 I/O Request</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

