bluekitchen/btstack/port/max32630-fthr/maxim/Firmware/MAX3263X/Libraries/CMSIS/Device/Maxim/MAX3263X/Include/max3263x.svd
        <!-- SPI1_REQ: SPI Master 1 I/O Mode Request -->
        <register>
          <name>SPI1_REQ</name>
          <description>SPI Master 1 I/O Mode Request</description>
          <addressOffset>0x0078</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>core_io_req</name>
              <description>SPI Master 1 Core I/O Request</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ss0_io_req</name>
              <description>SPI Master 1 SS[0] I/O Request</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ss1_io_req</name>
              <description>SPI Master 1 SS[1] I/O Request</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ss2_io_req</name>
              <description>SPI Master 1 SS[2] I/O Request</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>quad_io_req</name>
              <description>SPI Master 1 Quad I/O Request</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>fast_mode</name>
              <description>SPI Master 1 Fast Mode Request</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <!-- SPI1_ACK: SPI Master 1 I/O Mode Acknowledge -->
        <register>
          <name>SPI1_ACK</name>
          <description>SPI Master 1 I/O Mode Acknowledge</description>
          <addressOffset>0x007C</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>core_io_ack</name>
              <description>SPI Master 1 Core I/O Acknowledge</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ss0_io_ack</name>
              <description>SPI Master 1 SS[0] I/O Acknowledge</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[8:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ss1_io_ack</name>
              <description>SPI Master 1 SS[1] I/O Acknowledge</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[9:9]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ss2_io_ack</name>
              <description>SPI Master 1 SS[2] I/O Acknowledge</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[10:10]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>quad_io_ack</name>
              <description>SPI Master 1 Quad I/O Acknowledge</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[20:20]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>fast_mode</name>
              <description>SPI Master 1 Fast Mode Acknowledge</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[24:24]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>

        <!-- SPI2_REQ: SPI Master 2 I/O Mode Request -->
        <register>
          <name>SPI2_REQ</name>
          <description>SPI Master 2 I/O Mode Request</description>
          <addressOffset>0x0080</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>mapping_req</name>
              <description>SPI Master 2 I/O Mapping Select</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>core_io_req</name>
              <description>SPI Master 2 Core I/O Request</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ss0_io_req</name>
              <description>SPI Master 2 SS[0] I/O Request</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ss1_io_req</name>
              <description>SPI Master 2 SS[1] I/O Request</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ss2_io_req</name>
              <description>SPI Master 2 SS[2] I/O Request</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>sr0_io_req</name>
              <description>SPI Master 2 SR[0] I/O Request</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>sr1_io_req</name>
              <description>SPI Master 2 SR[1] I/O Request</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>quad_io_req</name>
              <description>SPI Master 2 Quad I/O Request</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>fast_mode</name>
              <description>SPI Master 2 Fast Mode Request</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <!-- SPI2_ACK: SPI Master 2 I/O Mode Acknowledge -->
        <register>
          <name>SPI2_ACK</name>
          <description>SPI Master 2 I/O Mode Acknowledge</description>
          <addressOffset>0x0084</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>mapping_ack</name>
              <description>SPI Master 2 I/O Mapping Acknowledge</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>core_io_ack</name>
              <description>SPI Master 2 Core I/O Acknowledge</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ss0_io_ack</name>
              <description>SPI Master 2 SS[0] I/O Acknowledge</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[8:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ss1_io_ack</name>
              <description>SPI Master 2 SS[1] I/O Acknowledge</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[9:9]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ss2_io_ack</name>
              <description>SPI Master 2 SS[2] I/O Acknowledge</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[10:10]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>sr0_io_req</name>
              <description>SPI Master 2 SR[0] I/O Acknowledge</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[16:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>sr1_io_req</name>
              <description>SPI Master 2 SR[1] I/O Acknowledge</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[17:17]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>quad_io_ack</name>
              <description>SPI Master 2 Quad I/O Acknowledge</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[20:20]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>fast_mode</name>
              <description>SPI Master 2 Fast Mode Acknowledge</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[24:24]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>

        <!-- SPIB_REQ: SPI Bridge I/O Mode Request -->
        <register>
          <name>SPIB_REQ</name>
          <description>SPI Bridge I/O Mode Request</description>
          <addressOffset>0x0088</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>core_io_req</name>
              <description>SPI Bridge Core I/O Request</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>quad_io_req</name>
              <description>SPI Bridge Quad I/O Request</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[8:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>fast_mode</name>
              <description>SPI Bridge Fast Mode Request</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[12:12]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>

