bluekitchen/btstack/port/max32630-fthr/maxim/Firmware/MAX3263X/Libraries/CMSIS/Device/Maxim/MAX3263X/Include/max3263x.svd
        <!-- INTEN1: Interrupt Enable/Disable Register 1 -->
        <register>
          <name>INTEN1</name>
          <description>Interrupt Enable/Disable Register 1</description>
          <addressOffset>0x0148</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>sram_addr_wrapped</name>
              <description>SRAM Address Wrapped Interrupt Enable/Disable</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>invalid_flash_addr</name>
              <description>Invalid Flash Address Interrupt Enable/Disable</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>flash_read_locked</name>
              <description>Flash Read from Locked Area Interrupt Enable/Disable</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>trim_update_done</name>
              <description>Trim Update Complete Interrupt Enable/Disable</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>flc_state_done</name>
              <description>FLC State Machine Reached DONE Interrupt Enable/Disable</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>flc_prog_complete</name>
              <description>Program (Write or Erase) Op Completed Int Enable/Disable</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <!-- BL_CTRL: Bootloader Control Register -->
        <register>
          <name>BL_CTRL</name>
          <description>Bootloader Control Register</description>
          <addressOffset>0x0170</addressOffset>
          <access>read-write</access>
        </register>

        <!-- TWK_CYCL_CNT: Cycle Count Tweak Register -->
        <register>
          <name>TWK_CYCL_CNT</name>
          <description>Cycle Count Tweak Register</description>
          <addressOffset>0x0174</addressOffset>
          <access>read-write</access>
        </register>

        <!-- PDM33: PDM33 Register -->
        <register>
          <name>PDM33</name>
          <description>PDM33 Register</description>
          <addressOffset>0x0178</addressOffset>
          <access>read-write</access>
        </register>

        <!-- SLM: Sleep Mode Register -->
        <register>
          <name>SLM</name>
          <description>Sleep Mode Register</description>
          <addressOffset>0x017C</addressOffset>
          <access>read-write</access>
        </register>

        <!-- DISABLE_XR0: Disable Flash Page Exec/Read Register 0 -->
        <register>
          <name>DISABLE_XR0</name>
          <description>Disable Flash Page Exec/Read Register 0</description>
          <addressOffset>0x0200</addressOffset>
          <access>read-write</access>
        </register>

        <!-- DISABLE_XR1: Disable Flash Page Exec/Read Register 1 -->
        <register>
          <name>DISABLE_XR1</name>
          <description>Disable Flash Page Exec/Read Register 1</description>
          <addressOffset>0x0204</addressOffset>
          <access>read-write</access>
        </register>

        <!-- DISABLE_XR2: Disable Flash Page Exec/Read Register 2 -->
        <register>
          <name>DISABLE_XR2</name>
          <description>Disable Flash Page Exec/Read Register 2</description>
          <addressOffset>0x0208</addressOffset>
          <access>read-write</access>
        </register>

        <!-- DISABLE_XR3: Disable Flash Page Exec/Read Register 3 -->
        <register>
          <name>DISABLE_XR3</name>
          <description>Disable Flash Page Exec/Read Register 3</description>
          <addressOffset>0x020C</addressOffset>
          <access>read-write</access>
        </register>

        <!-- DISABLE_XR4: Disable Flash Page Exec/Read Register 4 -->
        <register>
          <name>DISABLE_XR4</name>
          <description>Disable Flash Page Exec/Read Register 4</description>
          <addressOffset>0x0210</addressOffset>
          <access>read-write</access>
        </register>

        <!-- DISABLE_XR5: Disable Flash Page Exec/Read Register 5 -->
        <register>
          <name>DISABLE_XR5</name>
          <description>Disable Flash Page Exec/Read Register 5</description>
          <addressOffset>0x0214</addressOffset>
          <access>read-write</access>
        </register>

        <!-- DISABLE_XR6: Disable Flash Page Exec/Read Register 6 -->
        <register>
          <name>DISABLE_XR6</name>
          <description>Disable Flash Page Exec/Read Register 6</description>
          <addressOffset>0x0218</addressOffset>
          <access>read-write</access>
        </register>

        <!-- DISABLE_XR7: Disable Flash Page Exec/Read Register 7 -->
        <register>
          <name>DISABLE_XR7</name>
          <description>Disable Flash Page Exec/Read Register 7</description>
          <addressOffset>0x021C</addressOffset>
          <access>read-write</access>
        </register>

        <!-- DISABLE_WE0: Disable Flash Page Write/Erase Register 0 -->
        <register>
          <name>DISABLE_WE0</name>
          <description>Disable Flash Page Write/Erase Register 0</description>
          <addressOffset>0x0300</addressOffset>
          <access>read-write</access>
        </register>

        <!-- DISABLE_WE1: Disable Flash Page Write/Erase Register 1 -->
        <register>
          <name>DISABLE_WE1</name>
          <description>Disable Flash Page Write/Erase Register 1</description>
          <addressOffset>0x0304</addressOffset>
          <access>read-write</access>
        </register>

        <!-- DISABLE_WE2: Disable Flash Page Write/Erase Register 2 -->
        <register>
          <name>DISABLE_WE2</name>
          <description>Disable Flash Page Write/Erase Register 2</description>
          <addressOffset>0x0308</addressOffset>
          <access>read-write</access>
        </register>

        <!-- DISABLE_WE3: Disable Flash Page Write/Erase Register 3 -->
        <register>
          <name>DISABLE_WE3</name>
          <description>Disable Flash Page Write/Erase Register 3</description>
          <addressOffset>0x030C</addressOffset>
          <access>read-write</access>
        </register>

        <!-- DISABLE_WE4: Disable Flash Page Write/Erase Register 4 -->
        <register>
          <name>DISABLE_WE4</name>
          <description>Disable Flash Page Write/Erase Register 4</description>
          <addressOffset>0x0310</addressOffset>
          <access>read-write</access>
        </register>

        <!-- DISABLE_WE5: Disable Flash Page Write/Erase Register 5 -->
        <register>
          <name>DISABLE_WE5</name>
          <description>Disable Flash Page Write/Erase Register 5</description>
          <addressOffset>0x0314</addressOffset>
          <access>read-write</access>
        </register>

        <!-- DISABLE_WE6: Disable Flash Page Write/Erase Register 6 -->
        <register>
          <name>DISABLE_WE6</name>
          <description>Disable Flash Page Write/Erase Register 6</description>
          <addressOffset>0x0318</addressOffset>
          <access>read-write</access>
        </register>

        <!-- DISABLE_WE7: Disable Flash Page Write/Erase Register 7 -->
        <register>
          <name>DISABLE_WE7</name>
          <description>Disable Flash Page Write/Erase Register 7</description>
          <addressOffset>0x031C</addressOffset>
          <access>read-write</access>
        </register>

