bluekitchen/btstack/port/max32630-fthr/maxim/Firmware/MAX3263X/Libraries/CMSIS/Device/Maxim/MAX3263X/Include/max3263x.svd
      </registers>
    </peripheral>


    <!-- ICC:ICC -->

    <peripheral>
      <name>ICC</name>
      <description>Instruction Cache Controller</description>
      <!-- <groupName>ICC</groupName> -->
      <baseAddress>0x40003000</baseAddress>
      <size>32</size>
      <access>read-write</access>

      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>

      <registers>

        <!-- ID: Device ID Register -->
        <register>
          <name>ID</name>
          <description>Device ID Register</description>
          <addressOffset>0x0000</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>rtl_version</name>
              <description>RTL Release Version</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[5:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>part_num</name>
              <description>Part Number ID</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[9:6]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>cache_id</name>
              <description>Cache ID</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[15:10]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>

        <!-- MEM_CFG: Memory Configuration Register -->
        <register>
          <name>MEM_CFG</name>
          <description>Memory Configuration Register</description>
          <addressOffset>0x0004</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>cache_size</name>
              <description>Instruction Cache Size</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>main_memory_size</name>
              <description>Internal Flash Memory Size</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[31:16]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>

        <!-- CTRL_STAT: Control and Status -->
        <register>
          <name>CTRL_STAT</name>
          <description>Control and Status</description>
          <addressOffset>0x0100</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>enable</name>
              <description>Cache Enable</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ready</name>
              <description>Cache Ready Status</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[16:16]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>

        <!-- INVDT_ALL: Invalidate (Clear) Cache Control -->
        <register>
          <name>INVDT_ALL</name>
          <description>Invalidate (Clear) Cache Control</description>
          <addressOffset>0x0700</addressOffset>
          <access>read-write</access>
        </register>

      </registers>
    </peripheral>


    <!-- SPIX:SPIX -->

    <peripheral>
      <name>SPIX</name>
      <description>SPI XIP Interface</description>
      <groupName>SPI XIP</groupName>
      <baseAddress>0x40004000</baseAddress>
      <size>32</size>
      <access>read-write</access>

      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>

      <registers>

        <!-- MASTER_CFG: SPIX Master Configuration -->
        <register>
          <name>MASTER_CFG</name>
          <description>SPIX Master Configuration</description>
          <addressOffset>0x0000</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>spi_mode</name>
              <description>SPIX Mode</description>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SCK_HI_SAMPLE_RISING</name>
                  <description>SCK is active high, data is sampled on clock rising edge.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCK_LO_SAMPLE_FALLING</name>
                  <description>SCK is active low, data is sampled on clock rising edge.</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ss_act_lo</name>
              <description>SPIX Slave Select Polarity</description>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ACTIVE_HIGH</name>
                  <description>Enabled slave select (SS) is active high.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACTIVE_LOW</name>
                  <description>Enabled slave select (SS) is active low.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>alt_timing_en</name>
              <description>Alternate Timing Mode Enable</description>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Alternate timing is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED_AS_NEEDED</name>
                  <description>Alternate timing will be enabled automatically when needed.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>slave_sel</name>
              <description>SPIX Slave Select</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[6:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>sck_hi_clk</name>
              <description>SCK High Clocks</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>sck_lo_clk</name>
              <description>SCK Low Clocks</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[15:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>act_delay</name>
              <description>SS Active Timing</description>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>No SS Active timing delay enabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FOR_2_MOD_CLK</name>
                  <description>SS Active timing delay of 2 SPIX module clock cycles.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FOR_4_MOD_CLK</name>
                  <description>SS Active timing delay of 4 SPIX module clock cycles.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FOR_8_MOD_CLK</name>
                  <description>SS Active timing delay of 8 SPIX module clock cycles.</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
              <bitRange>[17:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>inact_delay</name>
              <description>SS Inactive Timing</description>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>No SS Active timing delay enabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FOR_2_MOD_CLK</name>
                  <description>SS Active timing delay of 2 SPIX module clock cycles.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FOR_4_MOD_CLK</name>
                  <description>SS Active timing delay of 4 SPIX module clock cycles.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FOR_8_MOD_CLK</name>
                  <description>SS Active timing delay of 8 SPIX module clock cycles.</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
              <bitRange>[19:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>alt_sck_hi_clk</name>
              <description>Alt SCK High Clocks</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[23:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>alt_sck_lo_clk</name>
              <description>Alt SCK Low Clocks</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[27:24]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <!-- FETCH_CTRL: SPIX Fetch Control -->
        <register>
          <name>FETCH_CTRL</name>
          <description>SPIX Fetch Control</description>
          <addressOffset>0x0004</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>cmd_value</name>
              <description>Command Value</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>cmd_width</name>
              <description>Command Width</description>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SINGLE</name>
                  <description>Single I/O used for Tx/Rx.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DUAL_IO</name>
                  <description>Dual I/O lines used for Tx/Rx.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QUAD_IO</name>
                  <description>Quad I/O lines used for Tx/Rx.</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
              <bitRange>[9:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>addr_width</name>
              <description>Address Width</description>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SINGLE</name>
                  <description>Single I/O used for Tx/Rx.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DUAL_IO</name>
                  <description>Dual I/O lines used for Tx/Rx.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QUAD_IO</name>
                  <description>Quad I/O lines used for Tx/Rx.</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
              <bitRange>[11:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>data_width</name>
              <description>Data Width</description>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SINGLE</name>
                  <description>Single I/O used for Tx/Rx.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DUAL_IO</name>
                  <description>Dual I/O lines used for Tx/Rx.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QUAD_IO</name>
                  <description>Quad I/O lines used for Tx/Rx.</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
              <bitRange>[13:12]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

