bluekitchen/btstack/port/max32630-fthr/maxim/Firmware/MAX3263X/Libraries/CMSIS/Device/Maxim/MAX3263X/Include/max3263x.svd
      </registers>
    </peripheral>


    <!-- ADC:ADC -->

    <peripheral>
      <name>ADC</name>
      <description>10-bit Analog to Digital Converter</description>
      <!-- <groupName>ADC</groupName> -->      
      <interrupt>
        <name>ADC</name>
        <value>48</value>
        <description>ADC IRQ</description>
      </interrupt>
      <baseAddress>0x4001F000</baseAddress>
      <size>32</size>
      <access>read-write</access>

      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>

      <registers>

        <!-- CTRL: ADC Control -->
        <register>
          <name>CTRL</name>
          <description>ADC Control</description>
          <addressOffset>0x0000</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>cpu_adc_start</name>
              <description>Start ADC Conversion</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>adc_pu</name>
              <description>ADC Power Up</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>buf_pu</name>
              <description>ADC Input Buffer Power Up</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>adc_refbuf_pu</name>
              <description>ADC Reference Buffer Power Up</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>adc_chgpump_pu</name>
              <description>ADC Charge Pump Power Up</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>buf_chop_dis</name>
              <description>ADC Input Buffer Chop Disable (INTERNAL ONLY)</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>buf_pump_dis</name>
              <description>Disable Use of Charge Pump Output by Input Buffer (INTERNAL)</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>buf_bypass</name>
              <description>Bypass Input Buffer</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>adc_refscl</name>
              <description>ADC Reference Scale</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>adc_scale</name>
              <description>ADC Scale</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>adc_refsel</name>
              <description>ADC Reference (VRef) Select (INTERNAL ONLY)</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>adc_clk_en</name>
              <description>ADC Clock Enable</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>adc_chsel</name>
              <description>ADC Channel Select</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[15:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>adc_xref</name>
              <description>Enable Use of ADC External Reference</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>adc_dataalign</name>
              <description>ADC Data Alignment Select</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>afe_pwr_up_dly</name>
              <description>Delay from ADC Powerup Until ADC Ready Asserted</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[31:24]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <!-- STATUS: ADC Status -->
        <register>
          <name>STATUS</name>
          <description>ADC Status</description>
          <addressOffset>0x0004</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>adc_active</name>
              <description>ADC Conversion In Progress</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ro_cal_atomic_active</name>
              <description>RO Frequency Calibration Active (If Atomic)</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>afe_pwr_up_active</name>
              <description>AFE Power Up Delay Active</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>adc_overflow</name>
              <description>ADC Overflow</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>

        <!-- DATA: ADC Output Data -->
        <register>
          <name>DATA</name>
          <description>ADC Output Data</description>
          <addressOffset>0x0008</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>adc_data</name>
              <description>ADC Converted Sample Data Output</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>

