bluekitchen/btstack/port/max32630-fthr/maxim/Firmware/MAX3263X/Libraries/CMSIS/Device/Maxim/MAX3263X/Include/max3263x.svd
        <!-- INTR: ADC Interrupt Control Register -->
        <register>
          <name>INTR</name>
          <description>ADC Interrupt Control Register</description>
          <addressOffset>0x000C</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>adc_done_ie</name>
              <description>ADC Done Interrupt Enable</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>adc_ref_ready_ie</name>
              <description>ADC Reference Ready Interrupt Enable</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>adc_hi_limit_ie</name>
              <description>ADC Hi Limit Monitor Interrupt Enable</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>adc_lo_limit_ie</name>
              <description>ADC Lo Limit Monitor Interrupt Enable</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>adc_overflow_ie</name>
              <description>ADC Overflow Interrupt Enable</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ro_cal_done_ie</name>
              <description>RO Cal Done Interrupt Enable</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>adc_done_if</name>
              <description>ADC Done Interrupt Flag</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>adc_ref_ready_if</name>
              <description>ADC Reference Ready Interrupt Flag</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>adc_hi_limit_if</name>
              <description>ADC Hi Limit Monitor Interrupt Flag</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>adc_lo_limit_if</name>
              <description>ADC Lo Limit Monitor Interrupt Flag</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>adc_overflow_if</name>
              <description>ADC Overflow Interrupt Flag</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>ro_cal_done_if</name>
              <description>RO Cal Done Interrupt Flag</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>adc_int_pending</name>
              <description>ADC Interrupt Pending Status</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[22:22]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>

        <!-- LIMIT0: ADC Limit -->
        <register>
          <name>LIMIT0</name>
          <description>ADC Limit</description>
          <addressOffset>0x0010</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>ch_lo_limit</name>
              <description>Low Limit Threshold</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[9:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ch_hi_limit</name>
              <description>High Limit Threshold</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[21:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ch_sel</name>
              <description>ADC Channel Select</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[27:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ch_lo_limit_en</name>
              <description>Low Limit Monitoring Enable</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ch_hi_limit_en</name>
              <description>High Limit Monitoring Enable</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

